#### Ques 1. Write a Pandas program to convert a Panda module Series to Python list and it’s type.

In [5]:
import pandas as pd
ds = pd.Series([3, 6, 9, 12, 15])
print(ds)
print(type(ds))
#Convert Pandas Series to Python list
print(ds.tolist())
print(type(ds.tolist()))

0     3
1     6
2     9
3    12
4    15
dtype: int64
<class 'pandas.core.series.Series'>
[3, 6, 9, 12, 15]
<class 'list'>

#### Ques 2.Write a Pandas program to convert a NumPy array to a Pandas series.
#### Sample NumPy array: d1 = [10, 20, 30, 40, 50]

In [9]:
import numpy as np
import pandas as pd
np_array = np.array([10, 20, 30, 40, 50])
print("NumPy array:", np_array)
new_series = pd.Series(np_array)
print("Converted Pandas series:")
print(new_series)

NumPy array: [10 20 30 40 50]
Converted Pandas series:
0    10
1    20
2    30
3    40
4    50
dtype: int32

#### Ques 3.Write a Pandas program to count the NaN values in one or more columns in DataFrame.

#### Sample data:
#### Original DataFrame
#### attempts name qualify score
#### 0 1 Anastasia yes 12.5
#### 1 3 Dima no 9.0
#### 2 2 Katherine yes 16.5
#### 3 3 James no NaN
#### 4 2 Emily no 9.0
#### 5 3 Michael yes 20.0
#### 6 1 Matthew yes 14.5
#### 7 1 Laura no NaN
#### 8 2 Kevin no 8.0
#### 9 1 Jonas yes 19.0
#### Number of NaN values in one or more columns:
#### 2

In [14]:
import pandas as pd
import numpy as np
smp_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(smp_data)
print(df)
print("\nNumber of NaN values in one or more columns:")
print(df.isnull().values.sum())

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

Number of NaN values in one or more columns:
2

#### Ques 4. Write a Pandas program to add, subtract, multiple and divide two Pandas Series.

#### Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]

In [24]:
import pandas as pd
ps1 = pd.Series([2,4,6,8,10])
ps2 = pd.Series([1,3,5,7,9])
ps = ps1 + ps2 # Addition
print(ps)
ps = ps1 - ps2 # Substract
print(ps)
ps = ps1 * ps2 # Multiply
print(ps)
ps = ps1 / ps2 # Divide
print(ps)

0     3
1     7
2    11
3    15
4    19
dtype: int64
0    1
1    1
2    1
3    1
4    1
dtype: int64
0     2
1    12
2    30
3    56
4    90
dtype: int64
0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

#### Ques 5. Write a Pandas program to create a multi Index frame using two columns and using an Index and a column.

#### Test Data:

#### 0        s001     V  Alberto Franco     15/05/2002      35  street1   t1
#### 1        s002     V    Gino Mcneill     17/05/2002      32  street2   t2
#### 2        s003    VI     Ryan Parkes     16/02/1999      33  street3   t3
#### 3        s001    VI    Eesha Hinton     25/09/1998      30  street1   t4
#### 4        s002     V    Gino Mcneill     11/05/2002      31  street2   t5
#### 5        s004    VI    David Parkes     15/09/1997      32  street4   t6

In [33]:
import pandas as pd
df = pd.DataFrame({
    'Student_id': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4'],
    't_id':['t1', 't2', 't3', 't4', 't5', 't6']})
print(df)
print("\nMultiIndex using columns 't_id' and ‘Student_id’:")
df1 = df.set_index(['t_id', 'Student_id'])
print(df1)
print("\nMultiIndex using an Index and a column:")
df2 = df.set_index([pd.Index([0, 1, 2, 3, 4, 5]), 't_id'])
print(df2)

  Student_id class            name date_Of_Birth  weight  address t_id
0       s001     V  Alberto Franco    15/05/2002      35  street1   t1
1       s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2       s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3       s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4       s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5       s004    VI    David Parkes    15/09/1997      32  street4   t6

MultiIndex using columns 't_id' and ‘Student_id’:
                class            name date_Of_Birth  weight  address
t_id Student_id
t1   s001           V  Alberto Franco    15/05/2002      35  street1
t2   s002           V    Gino Mcneill    17/05/2002      32  street2
t3   s003          VI     Ryan Parkes    16/02/1999      33  street3
t4   s001          VI    Eesha Hinton    25/09/1998      30  street1
t5   s002           V    Gino Mcneill    11/05/2002      31  street2
t6   s004          VI    David Parkes    15/09/1997      32  street4

MultiIndex using an Index and a column:
       Student_id class            name date_Of_Birth  weight  address
  t_id
0 t1         s001     V  Alberto Franco    15/05/2002      35  street1
1 t2         s002     V    Gino Mcneill    17/05/2002      32  street2
2 t3         s003    VI     Ryan Parkes    16/02/1999      33  street3
3 t4         s001    VI    Eesha Hinton    25/09/1998      30  street1
4 t5         s002     V    Gino Mcneill    11/05/2002      31  street2
5 t6         s004    VI    David Parkes    15/09/1997      32  street4

#### Ques 6. Write a Pandas program to split the following dataframe into groups based on school code. Also check the type of GroupBy object.

#### Test Data:

####school class            name date_Of_Birth   age  height  weight  address
#### S1   s001     V  Alberto Franco     15/05/2002   12    173      35  street1
#### S2   s002     V    Gino Mcneill     17/05/2002   12    192      32  street2
#### S3   s003    VI     Ryan Parkes     16/02/1999   13    186      33  street3
#### S4   s001    VI    Eesha Hinton     25/09/1998   13    167      30  street1
#### S5   s002     V    Gino Mcneill     11/05/2002   14    151      31  street2
#### S6   s004    VI    David Parkes     15/09/1997   12    159      32  street4

In [30]:
import pandas as pd
pd.set_option('display.max_rows', None)
#pd.set_option('display.max_columns', None)
student_data = pd.DataFrame({
    'student_id': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])

print(student_data)
print('\nSplit the said data on student_id wise:')
result = student_data.groupby(['student_id'])
for name,group in result:
    print("\nGroup:")
    print(name)
    print(group)
print("\nType of the object:")
print(type(result))

   student_id class            name date_Of_Birth   age  height  weight  \
S1       s001     V  Alberto Franco     15/05/2002   12     173      35
S2       s002     V    Gino Mcneill     17/05/2002   12     192      32
S3       s003    VI     Ryan Parkes     16/02/1999   13     186      33
S4       s001    VI    Eesha Hinton     25/09/1998   13     167      30
S5       s002     V    Gino Mcneill     11/05/2002   14     151      31
S6       s004    VI    David Parkes     15/09/1997   12     159      32

    address
S1  street1
S2  street2
S3  street3
S4  street1
S5  street2
S6  street4

Split the said data on student_id wise:

Group:
s001
   student_id class            name date_Of_Birth   age  height  weight  \
S1       s001     V  Alberto Franco     15/05/2002   12     173      35
S4       s001    VI    Eesha Hinton     25/09/1998   13     167      30

    address
S1  street1
S4  street1

Group:
s002
   student_id class          name date_Of_Birth   age  height  weight  address
S2       s002     V  Gino Mcneill     17/05/2002   12     192      32  street2
S5       s002     V  Gino Mcneill     11/05/2002   14     151      31  street2

Group:
s003
   student_id class         name date_Of_Birth   age  height  weight  address
S3       s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3

Group:
s004
   student_id class          name date_Of_Birth   age  height  weight  address
S6       s004    VI  David Parkes     15/09/1997   12     159      32  street4

Type of the object:
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>